app/Controllers/Api.php

    public function products()
    {
        // $data = $this->db->query("SELECT * FROM products as a JOIN product_categories as b ON a.categories_id = b.id")->getResultArray();
        $data =  $this->db->table('products')->get()->getResultArray();
---
SELECT *
FROM "products"